---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.Constraints
source: html/54528e2d-bb7a-0788-620f-b4be56d3124e.htm
---
# Autodesk.Revit.DB.GroupTypeId.Constraints Property

Constraints.

## Syntax (C#)
```csharp
public static ForgeTypeId Constraints { get; }
```